## Plan Result (reform_cft_vh_dev_acme)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * module.application_insights.azurerm_application_insights.this
* Update
  * azurerm_windows_function_app.funcapp
* Delete
  * azurerm_application_insights.appinsight




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsight will be destroyed
  # (because azurerm_application_insights.appinsight is not in configuration)
  - resource "azurerm_application_insights" "appinsight" {
      - app_id                                = "3baf164d-c15e-4936-8584-d3b3ab2c6da3" -> null
      - application_type                      = "web" -> null
      - connection_string                     = (sensitive value) -> null
      - daily_data_cap_in_gb                  = 100 -> null
      - daily_data_cap_notifications_disabled = false -> null
      - disable_ip_masking                    = false -> null
      - force_customer_storage_for_profiler   = false -> null
      - id                                    = "/subscriptions/705b2731-0e0b-4df7-8630-95f157f0a347/resourceGroups/cft-platform-dev-rg/providers/Microsoft.Insights/components/cft-platform-dev" -> null
      - instrumentation_key                   = (sensitive value) -> null
      - internet_ingestion_enabled            = true -> null
      - internet_query_enabled                = true -> null
      - local_authentication_disabled         = false -> null
      - location                              = "uksouth" -> null
      - name                                  = "cft-platform-dev" -> null
      - resource_group_name                   = "cft-platform-dev-rg" -> null
      - retention_in_days                     = 90 -> null
      - sampling_percentage                   = 100 -> null
      - tags                                  = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-enterprise-acme"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "development"
          - "startupMode"  = "always"
        } -> null
    }

  # azurerm_windows_function_app.funcapp will be updated in-place
  ~ resource "azurerm_windows_function_app" "funcapp" {
        id                                = "/subscriptions/705b2731-0e0b-4df7-8630-95f157f0a347/resourceGroups/cft-platform-dev-rg/providers/Microsoft.Web/sites/acmereformcftvhdev"
        name                              = "acmereformcftvhdev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-enterprise-acme"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "development"
            "startupMode"  = "always"
        }
        # (24 unchanged attributes hidden)

      ~ site_config {
          ~ application_insights_connection_string = (sensitive value)
            # (21 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.application_insights.azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = 50
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "cft-platform-dev"
      + resource_group_name                   = "cft-platform-dev-rg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise-acme"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
          + "startupMode"  = "always"
        }
      + workspace_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":30,"Program":"tfcmt","SHA1":"","Target":"reform_cft_vh_dev_acme","Vars":{}} -->